app/controllers/api/priv/v1/fouls_controller.rb

        def index
          @fouls = Foul.all
---
SELECT `fouls`.* FROM `fouls`

          def set_foul
            @foul = Foul.find(params[:id])
---
SELECT `fouls`.* FROM `fouls` WHERE `fouls`.`id` = 2 LIMIT 1