app/controllers/api/priv/v1/play_action_groups_controller.rb

        def index
          @play_action_groups = PlayActionGroup.all
---
SELECT `play_action_groups`.* FROM `play_action_groups`

          def set_play_action_group
            @play_action_group = PlayActionGroup.find(params[:id])
---
SELECT `play_action_groups`.* FROM `play_action_groups` WHERE `play_action_groups`.`id` = 2 LIMIT 1