app/controllers/api/priv/v1/seasons_controller.rb

        def index
          @seasons = current_user.seasons.all
---
SELECT `seasons`.* FROM `seasons` WHERE `seasons`.`user_id` = 1