app/controllers/fouls_controller.rb

SELECT `fouls`.* FROM `fouls`
---
  def index
    @fouls = Foul.all

SELECT `fouls`.* FROM `fouls` WHERE `fouls`.`id` = 1 LIMIT 1
---
    def set_foul
      @foul = Foul.find(params[:id])