app/controllers/games_controller.rb

  def index
    @games = Game.all
---
SELECT `games`.* FROM `games`