app/controllers/players_controller.rb

  def index
    @players = Player.all
---
SELECT `players`.* FROM `players`

  def create
    @player = Player.new(player_params)

    respond_to do |format|
      if @player.save
---
INSERT INTO `players` (`user_id`, `first_name`, `last_name`, `active`, `created_at`, `updated_at`) VALUES (1, 'Colin', 'Dye', TRUE, '2024-10-30 14:51:25.151477', '2024-10-30 14:51:25.151477')

    def set_player
      @player = Player.find(params[:id])
---
SELECT `players`.* FROM `players` WHERE `players`.`id` = 1 LIMIT 1