app/controllers/teams_controller.rb

SELECT `teams`.* FROM `teams`
---
  def index
    @teams = Team.all

INSERT INTO `teams` (`user_id`, `locale`, `abbreviation`, `is_opponent`, `primary_color`, `secondary_color`, `active`, `sort_order`, `created_at`, `updated_at`, `team_level_id`, `nickname`) VALUES (1, 'Belding', 'BBK', FALSE, '#ea7423', '#000000', TRUE, 0, '2024-10-30 16:55:07.794674', '2024-10-30 16:55:07.794674', 1, 'Black Knights')
---
  def create
    @team = Team.new(team_params)

    respond_to do |format|
      if @team.save

SELECT `teams`.* FROM `teams` WHERE `teams`.`id` = 1 LIMIT 1
---
    def set_team
      @team = Team.find(params[:id])